    IDENTIFICATION DIVISION.
       PROGRAM-ID. SquareCalculator.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  UserInput      PIC 9(4).
       01  Result         PIC 9(8).

       PROCEDURE DIVISION.
       BEGIN.
           DISPLAY "Enter a number: "
           ACCEPT UserInput
           COMPUTE Result = UserInput * UserInput
           DISPLAY "The square of " UserInput " is " Result
           STOP RUN.
